package lesson04;

public class Task01 {
    /*
    Напишите программу, которая объявляет три переменные типа float
    и присваивает им значения. Программа должна вычислять и
    выводить среднее значение этих трех чисел.
     */
    public static void main(String[] args) {

        float one = 3.2f;
        float two = 3.6f;
        float three = 3.8f;

        System.out.println("Middle= " + (one + two + three) / 3);

    }
}
