package home.app;

/*Задача: Создайте три переменные: две целочисленные переменные
 с любыми значениями и одну переменную для результата. Выполните
 суммирование первых двух переменных и сохраните результат в
 третьей переменной. Выведите результат на экран.
 */

public class HomeworkLesson04Task02 {
    public static void main(String[] args) {

        short numberOne = 3500;
        short numberTwo = 6500;
        int result = numberOne + numberTwo;
        System.out.println ("Результат: " + result);
    }
}
