package home.app;

/* Задача 1. Напишите программу, в которой вы объявите переменные для хранения вашего возраста,
 имени и является ли сегодня выходным (логическое значение). Инициализируйте
  эти переменные соответствующими значениями.
 */
public class HomeworkLesson04Task01 {
    public static void main(String[] args) {

        byte myAge = 36;
        String myName = "Viktor";
        boolean satDayOff = true;
        System.out.println("My age: " + myAge +
                "\n My name: " + myName +
                "\n Is Saturday a day off? - " +
                satDayOff);

    }
}
