package lesson05;

public class CleanCode {
    //Правила наименования переменных
    int currentPage = 10;
    // Правило lowerCamelCase
    // Они должны быть описательными
    //Не должны быть описаны одной буквой!!
    //Избегать специальных символов, например как $ или _
    //_ - заменяется на lowerCamelCase
    //Избегать цифр вначале названия переменной
    //Если boolean - is, can, hat, isAvailable, canExecute и т. д.
    boolean hasChildren = true;
    //также можно использовать глаголы

    //Правила методов

    //Название класса должно быть информативным
    //Избегать использования зарегистрированных слов
}
